-- MySQL dump 10.13  Distrib 8.0.42, for Win64 (x86_64)
--
-- Host: localhost    Database: donjjul
-- ------------------------------------------------------
-- Server version	8.0.42

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Current Database: `donjjul`
--

CREATE DATABASE /*!32312 IF NOT EXISTS*/ `donjjul` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;

USE `donjjul`;

--
-- Table structure for table `begin_store`
--

DROP TABLE IF EXISTS `begin_store`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `begin_store` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `address` varchar(255) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `business_number` varchar(255) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `category` varchar(255) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `latitude` double DEFAULT NULL,
  `longitude` double DEFAULT NULL,
  `name` varchar(255) COLLATE utf8mb4_general_ci DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `UK79a603imo7hgad59qr0uh4gtm` (`business_number`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `begin_store`
--

LOCK TABLES `begin_store` WRITE;
/*!40000 ALTER TABLE `begin_store` DISABLE KEYS */;
/*!40000 ALTER TABLE `begin_store` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `certificate`
--

DROP TABLE IF EXISTS `certificate`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `certificate` (
  `id` bigint NOT NULL,
  `issued_date` date DEFAULT NULL,
  `review_id` bigint DEFAULT NULL,
  `user_id` bigint DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `FKt1i0yie1a1yw2x6w23w3yeadg` (`review_id`),
  KEY `FKtnnj9ktwn18vtvap4yuptwxhg` (`user_id`),
  CONSTRAINT `FKt1i0yie1a1yw2x6w23w3yeadg` FOREIGN KEY (`review_id`) REFERENCES `reviews` (`id`),
  CONSTRAINT `FKtnnj9ktwn18vtvap4yuptwxhg` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `certificate`
--

LOCK TABLES `certificate` WRITE;
/*!40000 ALTER TABLE `certificate` DISABLE KEYS */;
/*!40000 ALTER TABLE `certificate` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `certificate_seq`
--

DROP TABLE IF EXISTS `certificate_seq`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `certificate_seq` (
  `next_val` bigint DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `certificate_seq`
--

LOCK TABLES `certificate_seq` WRITE;
/*!40000 ALTER TABLE `certificate_seq` DISABLE KEYS */;
INSERT INTO `certificate_seq` VALUES (1);
/*!40000 ALTER TABLE `certificate_seq` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `donation`
--

DROP TABLE IF EXISTS `donation`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `donation` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `amount` int NOT NULL,
  `donated_at` datetime(6) DEFAULT NULL,
  `target_id` bigint DEFAULT NULL,
  `user_id` bigint DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `FKj2ugx4nq76km94392fhpufus4` (`target_id`),
  KEY `FKjqx6doal59swi10cqcdgippee` (`user_id`),
  CONSTRAINT `FKj2ugx4nq76km94392fhpufus4` FOREIGN KEY (`target_id`) REFERENCES `donation_target` (`id`),
  CONSTRAINT `FKjqx6doal59swi10cqcdgippee` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `donation`
--

LOCK TABLES `donation` WRITE;
/*!40000 ALTER TABLE `donation` DISABLE KEYS */;
/*!40000 ALTER TABLE `donation` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `donation_target`
--

DROP TABLE IF EXISTS `donation_target`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `donation_target` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `description` varchar(255) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `image_url` varchar(255) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `name` varchar(255) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `introduction` varchar(255) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `phone_number` varchar(255) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `type` varchar(255) COLLATE utf8mb4_general_ci DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `donation_target`
--

LOCK TABLES `donation_target` WRITE;
/*!40000 ALTER TABLE `donation_target` DISABLE KEYS */;
/*!40000 ALTER TABLE `donation_target` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `good_store`
--

DROP TABLE IF EXISTS `good_store`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `good_store` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(100) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `street_address` varchar(100) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `business_number` varchar(20) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `category` varchar(50) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `lat` double DEFAULT NULL,
  `lng` double DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `business_number` (`business_number`)
) ENGINE=InnoDB AUTO_INCREMENT=252 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `good_store`
--

LOCK TABLES `good_store` WRITE;
/*!40000 ALTER TABLE `good_store` DISABLE KEYS */;
INSERT INTO `good_store` VALUES (1,'영광텔레콤','경기도 용인시 기흥구 동백죽전대로 444','554-18-00633','생활',37.27799785,127.1516013),(2,'디스이즈','경기도 파주시 평화로 326','206-24-55695','카페/디저트',37.77275129,126.7462739),(3,'초이초이','경기도 동두천시 동두천로 119','447-17-02317','음식점',37.892073,127.0546265),(4,'도화원기','경기도 김포시 김포한강1로78번길 41-5','189-04-02920','음식점',37.64408036,126.6719294),(5,'스타식당','경기도 시흥시 은계남길 55','542-58-00709','음식점',37.43147107,126.8006581),(6,'곰커피','경기도 성남시 분당구 판교역로 75','604-10-52463','카페/디저트',37.38752126,127.1076696),(7,'착한밥상','경기도 안산시 단원구 고잔2길 42','624-45-01091','음식점',37.31748257,126.8358759),(8,'피자나라치킨공주','경기도 성남시 분당구 매화로56번길 12-1','797-12-01824','음식점',37.4124873,127.1351993),(9,'르꼬끄스포르티브','경기도 용인시 기흥구 신고매로 124','312-28-19876','의류/잡화',37.22537619,127.120915),(10,'우동아저씨','경기도 파주시 가람로51번길 26-53','797-01-01527','음식점',37.73617589,126.7566091),(11,'캠핑하고싶닭','경기도 고양시 덕양구 보광로 188','454-04-02329','음식점',37.73114079,126.9108473),(12,'스페로수학학원','경기도 시흥시 배곧4로 103','846-92-01128','학원',37.37385618,126.7345724),(13,'티니샵','경기도 양평군 양평읍 백운길 14','123-31-98096','의류/잡화',37.49341845,127.5061543),(14,'미담','경기도 성남시 분당구 성남대로331번길 9-13','349-58-00454','음식점',37.36450961,127.1070949),(15,'아라뷰티케어','경기도 하남시 하남대로 809','137-23-00505','미용',37.54105533,127.2075878),(16,'백년손님서서갈비무한리필','경기도 파주시 청석로 264','343-75-00166','음식점',37.72557622,126.7182812),(17,'인생역전족발','경기도 화성시 남여울2길 17-4','319-13-01034','족발/보쌈',37.19778216,127.0522749),(18,'카페플러스셀','경기도 수원시 권선구 서수원로53번길 25-36','610-41-15360','카페/디저트',37.23239194,126.9779243),(19,'그린마트','경기도 이천시 부발읍 경충대로2092번길 39-9','129-26-48061','생활',37.25290855,127.4915783),(20,'피자나라치킨공주 태평점','경기도 성남시 수정구 남문로121번길 14-1','647-16-01610','음식점',37.44899142,127.1395482),(21,'9라파부대찌개','경기도 고양시 일산동구 숲속마을로 50-42','613-38-60452','음식점',37.66791714,126.7991207),(22,'안산무지개연합의원','경기도 안산시 상록구 항가울로 422','134-32-37039','의료시설',37.31810912,126.846186),(23,'키즈팡팡','경기도 남양주시 별내면 청학로68번길 3','218-13-72110','취미/여가',37.70767998,127.1191767),(24,'요나요나','경기도 평택시 안중읍 안현로서8길 21','856-47-00427','음식점',36.97896216,126.9230088),(25,'숯닭무','경기도 수원시 권선구 금곡로102번길 49-24','779-03-00086','음식점',37.27280072,126.9422049),(26,'야당핫헤어','경기도 파주시 송학1길 152','582-61-00411','미용',37.7150372,126.7645266),(27,'원이쌀밥','경기도 이천시 대월면 사동로 76-19','754-03-01539','음식점',37.2364395,127.4954494),(28,'버거1529','경기도 용인시 기흥구 흥덕1로 13','350-46-00918','음식점',37.2710302,127.0663399),(29,'송탄일번가부대찌개','경기도 평택시 경기대로 1405','875-05-00530','음식점',37.07049239,127.0640395),(30,'오카레','경기도 광명시 오리로985번안길 7','883-32-01540','음식점',37.47945412,126.8526394),(31,'제담칼국수','경기도 화성시 남양읍 남양로 586-3','749-06-02522','음식점',37.19225386,126.8221363),(32,'앤딩스터디카페 하대원점','경기도 성남시 중원구 둔촌대로 285','656-34-01296','생활',37.42984134,127.1497828),(33,'한우생각','경기도 오산시 내삼미로79번길 11','848-15-00842','음식점',37.16903208,127.0652711),(34,'스마일케이크','경기도 수원시 장안구 조원로112번길 10','593-47-00230','카페/디저트',37.30265634,127.0144714),(35,'화목기사식당','경기도 부천시 원미구 계남로 277','130-46-70595','음식점',37.50520795,126.7794035),(36,'어반그릴바베큐하우스','경기도 시흥시 서울대학로278번길 26','762-46-00464','음식점',37.36889423,126.7278277),(37,'점심','경기도 포천시 건너말길 7','443-10-01715','음식점',37.85417418,127.1657725),(38,'해법장곡이지학원','경기도 시흥시 진말로9번길 2','140-90-76454','학원',37.37846421,126.7852738),(39,'선한커피','경기도 화성시 동탄순환대로10길 42','254-22-01078','카페/디저트',37.16651861,127.1217557),(40,'국수타래','경기도 안산시 단원구 광덕4로 112','153-02-02780','음식점',37.31515099,126.824769),(41,'싸커코어','경기도 김포시 금포로 1117-20','862-31-00945','스포츠시설',37.64528898,126.7066306),(42,'일파스토','경기도 남양주시 호평로68번길 5','640-31-00914','음식점',37.65580829,127.248058),(43,'바나나래빗','경기도 시흥시 대은로 10','534-56-00228','카페/디저트',37.4398196,126.7931555),(44,'몽쁘띠','경기도 김포시 김포한강2로 262','814-29-00884','음식점',37.64818147,126.6629256),(45,'아이엔맘','경기도 의정부시 의정로 182-19','229-21-61826','카페/디저트',37.74923376,127.0349481),(46,'반촌대구막창갈매기살','경기도 안양시 만안구 장내로149번길 9','123-38-37685','음식점',37.39851999,126.9235191),(47,'프로곱창','경기도 고양시 일산동구 백석로86번길 12-3','592-78-00134','음식점',37.6472828,126.7877544),(48,'예만두','경기도 평택시 포승읍 여술2길 15','118-16-63990','음식점',36.98673516,126.8455977),(49,'돈까스짱','경기도 용인시 기흥구 보정로 117','629-43-00792','음식점',37.31984784,127.1142858),(50,'필립테이블','경기도 고양시 덕양구 호국로 1702-2','796-08-02162','음식점',37.7028909,126.9052113),(51,'라비에벨','경기도 남양주시 호평로 63','319-22-00599','생활',37.65626995,127.2470283),(52,'으뜸50안경','경기도 용인시 기흥구 동백5로 21-11','827-03-01593','의류/잡화',37.27739287,127.1526036),(53,'국무합기도','경기도 군포시 군포로 489-2','768-93-01320','학원',37.35021859,126.9441998),(54,'고기팩트','경기도 남양주시 화도읍 먹갓로서길 1','846-03-01731','생활',37.65668979,127.2731854),(55,'델리지오소','경기도 고양시 덕양구 신원로2길 62','765-16-00544','음식점',37.66099889,126.8885593),(56,'마라영웅 화정점','경기도 고양시 덕양구 화중로130번길 5-11','729-29-01213','음식점',37.63911096,126.8325991),(57,'한끼한죽','경기도 의정부시 용현로160번길 14-7','601-34-17269','음식점',37.73990426,127.0929866),(58,'카페메르시','경기도 고양시 일산동구 정발산로 24','238-23-00768','카페/디저트',37.65590291,126.7720456),(59,'정다방','경기도 의왕시 어내들로 5','120-48-00698','카페/디저트',37.36159698,126.9631442),(60,'두리상회','경기도 김포시 김포한강2로23번길 72','598-26-01016','음식점',37.64056014,126.6794341),(61,'드림라운지','경기도 고양시 일산서구 성저로 68','699-22-01096','음식점',37.68490633,126.7545546),(62,'프랑킨숯불양념구이치킨 고잔점','경기도 안산시 단원구 광덕대로 206','454-44-00628','음식점',37.31470083,126.8312116),(63,'수라간','경기도 고양시 일산서구 호수로 817','128-35-55877','음식점',37.6679979,126.7516407),(64,'거기','경기도 부천시 소사구 경인로134번길 52','356-02-02360','음식점',37.48177267,126.7698848),(65,'농부손수제비','경기도 화성시 팔탄면 시청로 807','751-60-00363','음식점',37.16759241,126.8797513),(66,'뚜레쥬르안산상록수','경기도 안산시 상록구 샘골로 190','134-33-04442','카페/디저트',37.30069543,126.8635799),(67,'같이행복공동체협동조합','경기도 안성시 미양면 협동단지길 3','222-81-34905','학원',36.95885766,127.2443867),(68,'메밀정원','경기도 수원시 권선구 칠보로88번길 122','657-01-00614','음식점',37.26394405,126.9433841),(69,'고구려짬뽕집','경기도 시흥시 수인로 3472-22','140-09-90424','음식점',37.44399379,126.7748032),(70,'뱃살도둑 안산고잔점','경기도 안산시 단원구 광덕대로 141','720-62-00529','음식점',37.30909314,126.8289455),(71,'키와마루아지','경기도 수원시 영통구 영일로 8','683-29-01106','음식점',37.24842623,127.0760134),(72,'용갈집','경기도 하남시 하남대로802번길 68','206-48-50982','음식점',37.54216489,127.2119133),(73,'생고기제작소','경기도 양주시 회천남로 88','735-14-00684','음식점',37.81854948,127.0928012),(74,'타니예르','경기도 용인시 기흥구 서천서로12번길 4-2','735-01-01757','카페/디저트',37.24060664,127.0736839),(75,'열정국밥','경기도 고양시 덕양구 화중로152번길 6-14','325-11-01388','음식점',37.63995876,126.8332204),(76,'브라더돈까스','경기도 오산시 오산로278번길 9','433-01-01676','음식점',37.1518915,127.0695902),(77,'가마치통닭 고양점','경기도 고양시 덕양구 혜음로 8','550-37-01136','음식점',37.70107717,126.9018231),(78,'길로마중','경기도 부천시 원미구 길주로 71','898-73-00250','음식점',37.50639388,126.7505258),(79,'고깃집','경기도 부천시 원미구 부천로3번길 41','116-02-12009','음식점',37.48492842,126.780526),(80,'유마카롱','경기도 수원시 영통구 권선로882번길 65-17','427-54-00227','카페/디저트',37.24736165,127.0427851),(81,'맨투맨영수학원','경기도 안산시 단원구 초지로 90','613-93-08514','학원',37.30673866,126.8151103),(82,'중화','경기도 성남시 분당구 불정로420번길 17-1','419-60-00514','음식점',37.37554692,127.1416136),(83,'꼬꼬스토리','경기도 남양주시 별내면 청학로92번길 29','391-60-00432','음식점',37.71081713,127.1174126),(84,'청년다방','경기도 동두천시 평화로2261번길 9-6','368-01-02712','음식점',37.88943264,127.055875),(85,'김찌개','경기도 광주시 경안안길 5','212-29-70380','음식점',37.41451277,127.2518914),(86,'션하게마시자','경기도 용인시 처인구 한터로152번길 2','668-11-00933','음식점',37.24848523,127.2270595),(87,'미소가와 문산점','경기도 파주시 문산읍 문향로75번길 124','734-14-00997','음식점',37.86206293,126.782242),(88,'운정초밥좋은날','경기도 파주시 산내로 106-1','626-13-01631','음식점',37.72716155,126.7376384),(89,'이태리부엌','경기도 용인시 처인구 명지로40번길 15-17','859-01-01354','음식점',37.23103949,127.1866654),(90,'봄봄공방','경기도 수원시 권선구 금곡로102번길 30','612-16-61252','학원',37.27286327,126.941145),(91,'안경스케치','경기도 시흥시 동서로 1071','111-53-01469','의류/잡화',37.38456789,126.8598374),(92,'라움','경기도 김포시 김포한강4로 162','458-29-01325','미용',37.64697786,126.6642228),(93,'포이남','경기도 의정부시 용민로 477','515-10-03793','음식점',37.75144124,127.1180554),(94,'윤이불닭발','경기도 파주시 후곡로 21','223-22-01133','음식점',37.75549107,126.7739305),(95,'홍차부부사진가게','경기도 안산시 상록구 본삼로 45','134-31-57834','생활',37.30109362,126.8650906),(96,'해필리','경기도 시흥시 서울대학로 328','406-69-00388','음식점',37.37409762,126.7297846),(97,'배떡 안성점','경기도 안성시 비룡3길 6','296-26-00498','음식점',37.01389491,127.2657436),(98,'자매꿈과자','경기도 화성시 동탄대로21길 10','375-37-01189','카페/디저트',37.20770076,127.0980072),(99,'거인미술학원','경기도 시흥시 은행로 149','854-95-01004','학원',37.44439826,126.7992565),(100,'서정부부약국','경기도 평택시 서정역로 48','429-71-00365','의료시설',37.05828725,127.0553159),(101,'별강정','경기도 양평군 서종면 북한강로 755','410-41-00758','음식점',37.60425828,127.3495598),(102,'매일식당','경기도 성남시 분당구 판교역로192번길 14-2','144-02-39245','음식점',37.39747349,127.1120432),(103,'랑차이','경기도 의정부시 평화로 220','201-23-04350','음식점',37.71164965,127.048052),(104,'버텍스 수지구청점','경기도 용인시 수지구 풍덕천로148번길 6','516-13-01367','음식점',37.32370985,127.098011),(105,'공감식탁','경기도 화성시 동탄순환대로 127-17','624-13-02008','음식점',37.1669561,127.1072771),(106,'삼백돈돈가츠 안산고잔점','경기도 안산시 단원구 광덕대로 138','121-28-62267','음식점',37.30869909,126.8306159),(107,'등촌샤브칼국수','경기도 화성시 효행로 1037','614-24-63246','음식점',37.21370827,127.0406931),(108,'서울더믿음치과','경기도 성남시 분당구 돌마로 75','399-29-00823','의료시설',37.35039643,127.1104495),(109,'피앤피모바일','경기도 고양시 일산동구 무궁화로 20-11','117-21-91032','생활',37.6618316,126.7675508),(110,'기와집옛날국수','경기도 화성시 남양읍 시청로202번길 74-27','210-24-41550','음식점',37.19651561,126.8280847),(111,'삼대불족발','경기도 평택시 안중읍 안현로서9길 20-4','218-05-10268','족발/보쌈',36.97805191,126.9227739),(112,'맛창꼬','경기도 남양주시 다산순환로 118-17','319-57-00422','음식점',37.62123478,127.1476287),(113,'달붕','경기도 시흥시 서울대학로264번길 7','782-15-02161','카페/디저트',37.36914245,126.7260656),(115,'오토스트','경기도 김포시 초당로16번길 114-6','348-65-00478','카페/디저트',37.63946257,126.6734566),(116,'신나는바다','경기도 구리시 갈매순환로 194','252-61-00301','음식점',37.63659904,127.1218049),(117,'피자스웨그 성남점','경기도 성남시 중원구 원터로 106','549-57-00718','음식점',37.43628357,127.1425189),(118,'신의주찹쌀순대','경기도 시흥시 중심상가로 317','780-03-00994','음식점',37.33759152,126.747666),(119,'옹기종기','경기도 시흥시 함송로14번길 13-9','491-15-01742','음식점',37.36286074,126.7292944),(120,'살롱드라움','경기도 안양시 동안구 관평로 183','835-21-01415','미용',37.39309562,126.959515),(121,'카페더로드865 세교점','경기도 오산시 수청로 80-3','840-06-02562','카페/디저트',37.17552492,127.0549396),(122,'사계절멸치국수N보쌈','경기도 수원시 장안구 장안로75번길 43','640-26-01068','족발/보쌈',37.29023192,127.0004962),(123,'임창정파절이세겹살 일산점','경기도 고양시 일산동구 중앙로 1305-30','205-08-14779','음식점',37.66151136,126.7696484),(124,'우리집으로','경기도 고양시 덕양구 마상로140번길 62','102-03-82430','음식점',37.65731522,126.8357427),(125,'서희생선구이밥상','경기도 안양시 만안구 안양로329번길 18','411-47-00786','음식점',37.40096729,126.9183213),(126,'히어로보드게임카페 철산점','경기도 광명시 오리로856번길 12','298-19-01286','취미/여가',37.47503056,126.8682266),(127,'미스터신돈까스','경기도 성남시 분당구 판교공원로5길 35','810-35-00296','음식점',37.39058261,127.0884994),(128,'시골순대','경기도 안산시 상록구 충장로 80','894-18-00865','음식점',37.28869543,126.8574667),(129,'정다운치과의원','경기도 파주시 월롱면 엘씨디로 201','660-96-01425','의료시설',37.80856915,126.7614704),(130,'애프터선데이클럽','경기도 성남시 분당구 야탑로149번길 5','353-07-02139','미용',37.41021657,127.1353421),(131,'일공공샤브','경기도 고양시 일산동구 정발산로 24','418-19-01366','음식점',37.65590291,126.7720456),(132,'한촌설렁탕','경기도 시흥시 정왕대로 78','384-16-00480','음식점',37.35312879,126.7250064),(133,'사진찍기좋은날','경기도 오산시 오산로50번길 24','523-07-01350','생활',37.13103132,127.0706515),(134,'멸치국수맛있는집','경기도 성남시 분당구 불곡로3번길 4','385-25-01562','음식점',37.35955593,127.1235568),(135,'점프 의정부점','경기도 의정부시 오목로 196','362-07-02259','카페/디저트',37.7439805,127.0993),(136,'크랙치킨','경기도 동두천시 장고갯로 283','155-54-00230','음식점',37.91640604,127.0576809),(137,'둥지칼국수','경기도 가평군 청평면 경춘로 221-12','303-51-00032','음식점',37.69579364,127.3827916),(138,'뜰쌈밥','경기도 평택시 팽성읍 송화택지로 146','392-18-01543','음식점',36.96334448,127.0650164),(139,'아국오국','경기도 의정부시 가능로125번길 28','726-55-00932','음식점',37.74829343,127.0447511),(140,'주양한식뷔페','경기도 하남시 하남대로 231','493-17-02187','음식점',37.49611308,127.2319572),(141,'중식당','경기도 부천시 원미구 부흥로 177','483-35-01415','음식점',37.4966424,126.7623643),(142,'치킨아메리카Z 평촌점','경기도 안양시 동안구 학의로 282','814-88-01406','음식점',37.40106356,126.9691333),(143,'덱스터버거','경기도 동두천시 평화로2313번길 8-35','786-22-01691','음식점',37.89600899,127.0570283),(144,'알찬집','경기도 이천시 영창로 148','422-16-01933','음식점',37.2817592,127.4389598),(145,'야들야들한보약족발보쌈 향남점','경기도 화성시 향남읍 상신하길로328번길 8-13','875-04-03199','음식점',37.11670178,126.9119554),(146,'모닉','경기도 양주시 부흥로 1936','317-32-01024','의류/잡화',37.79467586,127.0778866),(147,'한뫼당','경기도 고양시 일산동구 무궁화로 42-38','634-10-01704','음식점',37.6618458,126.7702027),(148,'신전떡볶이','경기도 하남시 역말로 47-1','846-65-00216','음식점',37.53620882,127.2018945),(149,'카레야','경기도 평택시 쇼핑로 23-1','619-05-65248','음식점',37.08113991,127.052026),(150,'고종의뜰','경기도 고양시 일산동구 위시티2로11번길 16','806-53-00137','카페/디저트',37.67732753,126.8126076),(151,'다룡짬뽕','경기도 평택시 진위면 진위서로 176','502-36-80891','음식점',37.10474002,127.0819332),(152,'초마맨1981','경기도 고양시 덕양구 권율대로 890','657-25-01846','음식점',37.66297331,126.8899164),(153,'파스타아미고 한강점','경기도 남양주시 경강로 377','248-43-00706','음식점',37.59245251,127.1997818),(154,'청춘수산','경기도 광주시 광주대로 52','859-37-00505','음식점',37.4113038,127.2608268),(155,'떡마을','경기도 용인시 수지구 현암로 165','142-05-42819','카페/디저트',37.33188998,127.1276639),(156,'포스트레','경기도 양평군 용문면 다문중앙1길 15','519-43-00520','카페/디저트',37.48471397,127.5916633),(157,'수작협동조합','경기도 과천시 별양상가2로 20','537-86-01413','학원',37.42682749,126.9925547),(158,'현우헤어공간','경기도 양주시 고읍남로 32','886-04-00528','미용',37.79397276,127.0784081),(159,'위더스학원','경기도 양주시 고암길 64','127-92-53845','학원',37.83165637,127.0695876),(160,'돈까스엔파스타','경기도 시흥시 배곧5로 78','502-37-52505','음식점',37.38240066,126.7358182),(161,'차이시룽','경기도 시흥시 거북섬로 211','684-42-00910','음식점',37.322888,126.6877722),(162,'뜨는청국장시대','경기도 시흥시 시청로72번길 16','670-19-00586','음식점',37.38164548,126.8011062),(163,'백스트리트피자','경기도 수원시 팔달구 정조로900번길 13','740-16-02086','음식점',37.28795128,127.0154722),(164,'크랩포차 철산점','경기도 광명시 오리로854번길 24','191-11-02353','음식점',37.47486073,126.8694592),(165,'나는통닭','경기도 안양시 동안구 관평로 76','260-54-00740','음식점',37.38434852,126.9652784),(166,'라와마라탕 야당점','경기도 파주시 경의로 1016','809-77-00471','음식점',37.70825164,126.7594448),(167,'카페마노아','경기도 남양주시 와부읍 수레로1번길 23','619-14-17054','카페/디저트',37.58841994,127.2130294),(168,'반달음악학원','경기도 화성시 동탄대로시범길 193','363-92-01851','학원',37.20141125,127.1085424),(169,'병아리스낵','경기도 양주시 화합로 1361','479-47-00953','음식점',37.84357097,127.0624867),(170,'제이디핫독','경기도 오산시 성호대로 123','805-06-02628','음식점',37.1490317,127.0752271),(171,'빠앙','경기도 부천시 오정구 원종로 106','764-27-01041','카페/디저트',37.52391488,126.811872),(172,'찐스뉴욕베이글','경기도 수원시 장안구 송정로187번길 75','612-36-01169','카페/디저트',37.3013139,127.0136026),(173,'고피자 안산고잔점','경기도 안산시 단원구 광덕1로 193','288-10-02214','음식점',37.30819533,126.8311923),(174,'양푼애등갈비','경기도 수원시 영통구 청명남로4번길 5-4','571-64-00260','음식점',37.25037377,127.0739864),(175,'오늘두탈모피하자','경기도 안산시 상록구 부곡로 32','457-16-01661','미용',37.32543334,126.8597442),(176,'옆집컴퓨터','경기도 양주시 옥정동로4길 11','734-24-00813','생활',37.81455263,127.099667),(177,'이지다헤어','경기도 수원시 장안구 송정로 58-1','274-22-00374','미용',37.29588138,127.003485),(178,'어부의밥상','경기도 광명시 소하로 81','355-04-01659','음식점',37.44763834,126.8840171),(179,'후안즈','경기도 성남시 분당구 판교공원로2길 55','326-38-00512','음식점',37.38986816,127.0919653),(180,'민들레한의원','경기도 의정부시 평화로 630','127-92-89815','의료시설',37.74811292,127.0455907),(181,'우리집손만두','경기도 용인시 처인구 양지면 양지로 161','789-08-00676','음식점',37.23437276,127.2862477),(182,'마왕족발 시흥목감점','경기도 시흥시 남왕길 48-18','196-32-00942','족발/보쌈',37.38271531,126.8628443),(183,'황금참치','경기도 파주시 문산읍 방촌로 1719-57','321-14-00506','음식점',37.8670759,126.7842502),(184,'고기굼터육방','경기도 김포시 풍무로146번길 52-9','777-05-03155','음식점',37.6070277,126.7268604),(185,'중식당','경기도 파주시 중앙로 264','210-32-51640','음식점',37.75983209,126.7778098),(186,'노모어피자 가능역점','경기도 의정부시 평화로 630','637-55-00796','음식점',37.74811292,127.0455907),(187,'교동짬뽕 오산점','경기도 오산시 가수안길 13','339-14-01879','음식점',37.14426906,127.0508311),(188,'초이닭칼국수','경기도 화성시 동탄첨단산업1로 58','171-78-00368','음식점',37.21393184,127.0919879),(189,'레터인케이크','경기도 화성시 왕배산2길 4-10','120-33-01373','카페/디저트',37.18096846,127.1247181),(191,'행복한진짓상','경기도 고양시 덕양구 권율대로 896-17','134-85-60690','음식점',37.66281296,126.8918887),(192,'대지식당','경기도 화성시 팔탄면 서촌길21번길 8','397-08-02062','음식점',37.1618201,126.9032229),(193,'동오짬뽕','경기도 의정부시 추동로1번길 31','199-29-01519','음식점',37.74400004,127.055947),(194,'호민범','경기도 용인시 기흥구 기흥로30번길 10-12','793-24-01766','음식점',37.27797409,127.1169399),(195,'이정칼국수모밀','경기도 평택시 비전9길 5','549-29-00277','음식점',37.00267155,127.1090794),(196,'호미불닭발 하남점','경기도 하남시 미사강변중앙로 193','629-04-02525','음식점',37.56375463,127.1896203),(197,'배무치숯불두마리치킨','경기도 파주시 문산읍 당동1로 25-30','698-31-01440','음식점',37.86115503,126.7737786),(198,'차분헤어','경기도 구리시 갈매순환로204번길 20','697-43-00984','미용',37.63759869,127.1222257),(199,'서호돈가스','경기도 성남시 분당구 판교로255번길 9-22','379-05-01875','음식점',37.40402562,127.100092),(200,'킴스쿠치나','경기도 양주시 옥정동로5길 28','347-25-01745','음식점',37.81649152,127.0974777),(201,'셀렉토커피 화성향남점','경기도 화성시 향남읍 행정서로3길 4-56','438-32-01340','카페/디저트',37.13005971,126.9177581),(202,'레몬트리기타교습소','경기도 수원시 팔달구 덕영대로697번길 17','608-96-10192','학원',37.28493347,126.9909561),(203,'7번가피자 수지상현점','경기도 용인시 수지구 풍덕천로22번길 28','832-43-00137','음식점',37.3164499,127.0831327),(204,'수내통닭','경기도 성남시 분당구 내정로165번길 38','121-38-91591','음식점',37.37664657,127.1164719),(205,'안경매니져 상현점','경기도 용인시 수지구 만현로 103','822-03-02471','의류/잡화',37.30738385,127.0854464),(206,'경기광주신현필아트미술학원','경기도 광주시 신현로12번길 13','311-90-80943','학원',37.35855399,127.1486139),(207,'헤어살롱단장','경기도 수원시 권선구 호매실로 100','147-80-80235','미용',37.25572517,126.9626435),(208,'에듀앤더교습소','경기도 김포시 김포한강11로 288-19','157-95-01617','학원',37.6547137,126.6824557),(209,'동탄리요가','경기도 화성시 동탄반석로 124','235-08-00596','학원',37.20000671,127.0715267),(210,'삼대돈카츠','경기도 양주시 부흥로 1932','439-43-00831','음식점',37.79444178,127.0776366),(211,'아시카페','경기도 남양주시 진접읍 장현로107번길 1','822-25-00062','카페/디저트',37.71967056,127.1834272),(212,'더평안','경기도 고양시 일산서구 현중로36번길 77','532-09-01061','카페/디저트',37.69459977,126.7719839),(213,'모둘리','경기도 광명시 오리로 649','203-13-22883','미용',37.45910119,126.8770482),(214,'모꼬지','경기도 평택시 문화촌로19번길 7-6','305-70-08972','음식점',36.99714308,127.1142167),(215,'북촌손만두','경기도 고양시 일산동구 강송로 33','763-10-02016','음식점',37.64406626,126.7928057),(216,'서양밥집','경기도 평택시 안중읍 송담2로 55','584-41-00743','카페/디저트',36.98026351,126.929095),(217,'꿀단지텔레콤','경기도 평택시 평택로64번길 46','125-24-32786','생활',36.99472422,127.0869938),(218,'아이굿안경','경기도 평택시 청북읍 안청로 340','237-34-00816','의류/잡화',37.01830743,126.915665),(219,'신아띠마라탕','경기도 여주시 가남읍 태평1길 18-1','720-33-01213','음식점',37.20456924,127.5487141),(220,'1982성북동왕돈까스','경기도 고양시 덕양구 충장로282번길 128','826-54-00405','음식점',37.64109868,126.8431998),(221,'따세비어','경기도 구리시 안골로8번길 67','763-11-00688','음식점',37.59458299,127.1329124),(222,'카페몽몽','경기도 김포시 김포한강9로75번길 102','234-01-28379','카페/디저트',37.64397831,126.6227206),(223,'슈퍼맨인테리어디자인','경기도 안양시 동안구 귀인로 209','716-09-01112','생활',37.38630281,126.9622513),(224,'덮밥카노','경기도 의정부시 용민로 70','752-24-01674','음식점',37.73697231,127.0861306),(225,'뽕짝','경기도 수원시 영통구 태장로71번길 8','104-13-93719','음식점',37.23977914,127.0542987),(226,'본만두 권선점','경기도 수원시 권선구 권중로56번길 39','680-45-00791','음식점',37.25307841,127.029138),(227,'아침식빵','경기도 부천시 원미구 상일로122번길 19','726-09-01856','카페/디저트',37.49052954,126.755961),(228,'강력풍천장어','경기도 안산시 단원구 광덕2로 156-5','157-26-01488','음식점',37.30934381,126.8278282),(229,'앤의식탁','경기도 안산시 상록구 성안길 84-1','381-01-01093','음식점',37.3010965,126.838596),(230,'한빛안경원','경기도 남양주시 진접읍 장현로 77','224-03-21072','의류/잡화',37.71761125,127.1808928),(231,'유미카츠 은계점','경기도 시흥시 은계번영길 7','239-51-00541','음식점',37.43710404,126.8016262),(232,'잇쇼니키친','경기도 파주시 번영로 56','119-24-00635','음식점',37.75791,126.76691),(233,'동구짬뽕','경기도 구리시 동구릉로148번길 24-34','854-46-00327','음식점',37.61137042,127.1390129),(234,'오늘찬','경기도 화성시 동탄대로24길 198','570-40-00989','생활',37.20591006,127.1153641),(235,'카페디셈버','경기도 남양주시 경춘로 368','713-13-01051','카페/디저트',37.60461027,127.1556364),(236,'라와마라탕 일산점','경기도 고양시 일산동구 중앙로1275번길 38-5','405-11-43379','음식점',37.65946758,126.7703914),(237,'코사마트','경기도 하남시 대청로116번길 59-1','126-19-66214','생활',37.53708722,127.2244015),(238,'통하자체인사업국','경기도 화성시 우정읍 조암북로68번나길 3-1','154-03-01175','의류/잡화',37.08622612,126.8221257),(239,'달달해커피','경기도 화성시 동탄하나3길 3-1','346-25-00573','카페/디저트',37.21381577,127.0627635),(240,'조개에빠진칼국수','경기도 이천시 향교로 31','819-43-00847','음식점',37.28502233,127.4410085),(241,'헤어바이수다','경기도 부천시 원미구 중동로262번길 38','508-10-91417','미용',37.50263311,126.7709969),(242,'추오정남원추어탕','경기도 남양주시 진접읍 진건오남로 1029','424-22-00232','음식점',37.71098536,127.183315),(243,'봉추찜닭 하안점','경기도 광명시 범안로 1042','291-17-00453','음식점',37.4618333,126.8790331),(244,'스윗미나','경기도 남양주시 진접읍 장현천로 51','533-48-00384','카페/디저트',37.72062824,127.1817168),(245,'보다안경원','경기도 안양시 만안구 병목안로 20','560-43-00343','의류/잡화',37.39895805,126.9183687),(246,'카페조슈아','경기도 평택시 화촌2길 7-15','317-09-01292','카페/디저트',36.99179675,127.0719604),(247,'천하장사','경기도 남양주시 진접읍 장현천로76번길 4','397-61-00297','음식점',37.7228273,127.1812685),(248,'푸릴리 수원권선점','경기도 수원시 권선구 효원로 188','203-22-52754','음식점',37.2638924,127.0224006),(249,'돈카츠답다','경기도 안산시 상록구 창말2길 25','261-14-01843','음식점',37.30566294,126.9029599),(250,'복고설렁탕','경기도 화성시 향남읍 상신하길로328번길 20','291-18-00988','음식점',37.11657635,126.9129232),(251,'가마로강정 태전점','경기도 광주시 태전동로 25','207-26-08471','음식점',37.38677026,127.2344317);
/*!40000 ALTER TABLE `good_store` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `proposal_vote`
--

DROP TABLE IF EXISTS `proposal_vote`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `proposal_vote` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `created_at` datetime(6) NOT NULL,
  `vote_type` enum('DOWN','UP') COLLATE utf8mb4_general_ci NOT NULL,
  `proposal_id` bigint NOT NULL,
  `user_id` bigint NOT NULL,
  PRIMARY KEY (`id`),
  KEY `FKs6j4b3w7q42070af3tkvv70cq` (`proposal_id`),
  KEY `FKk9q3mgeef81your47pcy2pfpn` (`user_id`),
  CONSTRAINT `FKk9q3mgeef81your47pcy2pfpn` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`),
  CONSTRAINT `FKs6j4b3w7q42070af3tkvv70cq` FOREIGN KEY (`proposal_id`) REFERENCES `store_proposal` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `proposal_vote`
--

LOCK TABLES `proposal_vote` WRITE;
/*!40000 ALTER TABLE `proposal_vote` DISABLE KEYS */;
/*!40000 ALTER TABLE `proposal_vote` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `receipt_log`
--

DROP TABLE IF EXISTS `receipt_log`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `receipt_log` (
  `id` int NOT NULL AUTO_INCREMENT,
  `user_id` int DEFAULT NULL,
  `store_id` int DEFAULT NULL,
  `receipt_image_url` varchar(255) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `business_number` varchar(20) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `verified` tinyint(1) DEFAULT NULL,
  `verified_at` datetime DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `receipt_log_ibfk_2_idx` (`store_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `receipt_log`
--

LOCK TABLES `receipt_log` WRITE;
/*!40000 ALTER TABLE `receipt_log` DISABLE KEYS */;
/*!40000 ALTER TABLE `receipt_log` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `reviews`
--

DROP TABLE IF EXISTS `reviews`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `reviews` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `content` varchar(255) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `created_at` datetime(6) DEFAULT NULL,
  `rating` int NOT NULL,
  `store_id` bigint NOT NULL,
  `user_id` bigint NOT NULL,
  `payment_date` datetime(6) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `FK4l3wwkxkjsan3lrk852stjvlw` (`store_id`),
  KEY `FKcgy7qjc1r99dp117y9en6lxye` (`user_id`),
  CONSTRAINT `FK4l3wwkxkjsan3lrk852stjvlw` FOREIGN KEY (`store_id`) REFERENCES `store` (`id`),
  CONSTRAINT `FKcgy7qjc1r99dp117y9en6lxye` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=20 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `reviews`
--

LOCK TABLES `reviews` WRITE;
/*!40000 ALTER TABLE `reviews` DISABLE KEYS */;
INSERT INTO `reviews` VALUES (15,'굿굿','2025-05-31 00:00:00.000000',5,1,1,NULL),(16,'바삭바삭하고 양도 많아요','2025-06-05 00:00:00.000000',4,2,1,NULL);
/*!40000 ALTER TABLE `reviews` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `store`
--

DROP TABLE IF EXISTS `store`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `store` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `address` varchar(255) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `business_number` varchar(255) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `created_at` datetime(6) DEFAULT NULL,
  `description` varchar(255) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `is_certified` bit(1) DEFAULT NULL,
  `is_disaster_area` bit(1) DEFAULT NULL,
  `latitude` double DEFAULT NULL,
  `longitude` double DEFAULT NULL,
  `name` varchar(255) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `category` varchar(255) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `image` longtext COLLATE utf8mb4_general_ci,
  `work_time` varchar(255) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `store_phone` varchar(255) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `rating` varchar(255) COLLATE utf8mb4_general_ci DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `UK7ld4maca37a3yx1afs74am798` (`business_number`)
) ENGINE=InnoDB AUTO_INCREMENT=251 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `store`
--

LOCK TABLES `store` WRITE;
/*!40000 ALTER TABLE `store` DISABLE KEYS */;
INSERT INTO `store` VALUES (1,'경기도 의왕시 청계동 699-2','138-10-13658','2025-04-22 00:00:00.000000','오리로스 전문점',_binary '',_binary '\0',35.858,127.454,'시골집','음식점','store1.jpg','11:30~21:30','0507-1322-4790','4.6'),(2,'경기도 광주시 태전동로 25','207-26-08471',NULL,'닭강정, 치킨 프랜차이즈',NULL,NULL,37.38677026,127.2344317,'가마로강정 태전점','음식점','store2.jpg','11:50~22:30','031-427-7292','4.4'),(3,'경기도 김포시 김포한강1로78번길 41-5','189-04-02920',NULL,'중화요리전문점',NULL,NULL,37.64408036,126.6719294,'도화원기','음식점','store3.jpg','17:00~02:00','0507-1493-8943','4.5'),(4,'경기도 시흥시 은계남길 55','542-58-00709',NULL,'신선한 고기, 계절 해산물',NULL,NULL,37.43147107,126.8006581,'스타식당','음식점','store4.jpg','11:00~20:00','1588-8069','4.2'),(5,'경기도 성남시 분당구 판교역로 75','604-10-52463',NULL,'어린이도서관 종합분식',NULL,NULL,37.38752126,127.1076696,'곰커피','카페/디저트','store5.jpg','09:00~19:00','0507-1482-5520','3.9'),(6,'경기도 안산시 단원구 고잔2길 42','624-45-01091',NULL,'건강한 백반, 가정식',NULL,NULL,37.31748257,126.8358759,'착한밥상','음식점','store6.jpg','06:00~24:00','0507-1439-0496','4.3'),(7,'경기도 성남시 분당구 매화로56번길 12-1','797-12-01824',NULL,'20년전통 가성비 피자치킨',NULL,NULL,37.4124873,127.1351993,'피자나라치킨공주','음식점','store7.jpg','17:00~06:00','031-487-9812','3.7'),(8,'경기도 용인시 기흥구 신고매로 124','312-28-19876',NULL,'품질 좋은 스포츠웨어',NULL,NULL,37.22537619,127.120915,'르꼬끄스포르티브','의류/잡화','store8.jpg','10:30~21:00','031-8036-3188','3.8'),(9,'경기도 파주시 가람로51번길 26-53','797-01-01527',NULL,'뜨끈하고 깊은 우동',NULL,NULL,37.73617589,126.7566091,'우동아저씨','음식점','store9.jpg','12:00~19:00','1588-8069','4.0'),(10,'경기도 고양시 덕양구 보광로 188','454-04-02329',NULL,'맛있는 반찬과 좋은 분위기',NULL,NULL,37.73114079,126.9108473,'캠핑하고싶닭','음식점','store10.jpg','13:00~22:50','0507-1400-4006','4.5'),(11,'경기도 시흥시 배곧4로 103','846-92-01128',NULL,'깔끔한 시설과 좋은 교육',NULL,NULL,37.37385618,126.7345724,'스페로수학학원','학원','store11.jpg','15:00~22:00','031-497-0507','4.2'),(12,'경기도 양평군 양평읍 백운길 14','123-31-98096',NULL,'귀여운 유아동복',NULL,NULL,37.49341845,127.5061543,'티니샵','의류/잡화','store12.jpg','09:00~22:00','0507-1322-4496','4.3'),(14,'경기도 성남시 분당구 성남대로331번길 9-13','349-58-00454',NULL,NULL,NULL,NULL,37.36450961,127.1070949,'미담','음식점',NULL,'8:00~22:00','1588-8069',NULL),(15,'경기도 하남시 하남대로 809','137-23-00505',NULL,NULL,NULL,NULL,37.54105533,127.2075878,'아라뷰티케어','미용',NULL,'8:00~22:00','1588-8069',NULL),(16,'경기도 파주시 청석로 264','343-75-00166',NULL,NULL,NULL,NULL,37.72557622,126.7182812,'백년손님서서갈비무한리필','음식점',NULL,'8:00~22:00','1588-8069',NULL),(17,'경기도 화성시 남여울2길 17-4','319-13-01034',NULL,NULL,NULL,NULL,37.19778216,127.0522749,'인생역전족발','족발/보쌈',NULL,'8:00~22:00','1588-8069',NULL),(18,'경기도 수원시 권선구 서수원로53번길 25-36','610-41-15360',NULL,NULL,NULL,NULL,37.23239194,126.9779243,'카페플러스셀','카페/디저트',NULL,'8:00~22:00','1588-8069',NULL),(19,'경기도 이천시 부발읍 경충대로2092번길 39-9','129-26-48061',NULL,NULL,NULL,NULL,37.25290855,127.4915783,'그린마트','생활',NULL,'8:00~22:00','1588-8069',NULL),(20,'경기도 성남시 수정구 남문로121번길 14-1','647-16-01610',NULL,NULL,NULL,NULL,37.44899142,127.1395482,'피자나라치킨공주 태평점','음식점',NULL,'8:00~22:00','1588-8069',NULL),(21,'경기도 고양시 일산동구 숲속마을로 50-42','613-38-60452',NULL,NULL,NULL,NULL,37.66791714,126.7991207,'9라파부대찌개','음식점',NULL,'8:00~22:00','1588-8069',NULL),(22,'경기도 안산시 상록구 항가울로 422','134-32-37039',NULL,NULL,NULL,NULL,37.31810912,126.846186,'안산무지개연합의원','의료시설',NULL,'8:00~22:00','1588-8069',NULL),(23,'경기도 남양주시 별내면 청학로68번길 3','218-13-72110',NULL,NULL,NULL,NULL,37.70767998,127.1191767,'키즈팡팡','취미/여가',NULL,'8:00~22:00','1588-8069',NULL),(24,'경기도 평택시 안중읍 안현로서8길 21','856-47-00427',NULL,NULL,NULL,NULL,36.97896216,126.9230088,'요나요나','음식점',NULL,'8:00~22:00','1588-8069',NULL),(25,'경기도 수원시 권선구 금곡로102번길 49-24','779-03-00086',NULL,NULL,NULL,NULL,37.27280072,126.9422049,'숯닭무','음식점',NULL,'8:00~22:00','1588-8069',NULL),(26,'경기도 파주시 송학1길 152','582-61-00411',NULL,NULL,NULL,NULL,37.7150372,126.7645266,'야당핫헤어','미용',NULL,'8:00~22:00','1588-8069',NULL),(27,'경기도 이천시 대월면 사동로 76-19','754-03-01539',NULL,NULL,NULL,NULL,37.2364395,127.4954494,'원이쌀밥','음식점',NULL,'8:00~22:00','1588-8069',NULL),(28,'경기도 용인시 기흥구 흥덕1로 13','350-46-00918',NULL,NULL,NULL,NULL,37.2710302,127.0663399,'버거1529','음식점',NULL,'8:00~22:00','1588-8069',NULL),(29,'경기도 평택시 경기대로 1405','875-05-00530',NULL,NULL,NULL,NULL,37.07049239,127.0640395,'송탄일번가부대찌개','음식점',NULL,'8:00~22:00','1588-8069',NULL),(30,'경기도 광명시 오리로985번안길 7','883-32-01540',NULL,NULL,NULL,NULL,37.47945412,126.8526394,'오카레','음식점',NULL,'8:00~22:00','1588-8069',NULL),(31,'경기도 화성시 남양읍 남양로 586-3','749-06-02522',NULL,NULL,NULL,NULL,37.19225386,126.8221363,'제담칼국수','음식점',NULL,'8:00~22:00','1588-8069',NULL),(32,'경기도 성남시 중원구 둔촌대로 285','656-34-01296',NULL,NULL,NULL,NULL,37.42984134,127.1497828,'앤딩스터디카페 하대원점','생활',NULL,'8:00~22:00','1588-8069',NULL),(33,'경기도 오산시 내삼미로79번길 11','848-15-00842',NULL,NULL,NULL,NULL,37.16903208,127.0652711,'한우생각','음식점',NULL,'8:00~22:00','1588-8069',NULL),(34,'경기도 수원시 장안구 조원로112번길 10','593-47-00230',NULL,NULL,NULL,NULL,37.30265634,127.0144714,'스마일케이크','카페/디저트',NULL,'8:00~22:00','1588-8069',NULL),(35,'경기도 부천시 원미구 계남로 277','130-46-70595',NULL,NULL,NULL,NULL,37.50520795,126.7794035,'화목기사식당','음식점',NULL,'8:00~22:00','1588-8069',NULL),(36,'경기도 시흥시 서울대학로278번길 26','762-46-00464',NULL,NULL,NULL,NULL,37.36889423,126.7278277,'어반그릴바베큐하우스','음식점',NULL,'8:00~22:00','1588-8069',NULL),(37,'경기도 포천시 건너말길 7','443-10-01715',NULL,NULL,NULL,NULL,37.85417418,127.1657725,'점심','음식점',NULL,'8:00~22:00','1588-8069',NULL),(38,'경기도 시흥시 진말로9번길 2','140-90-76454',NULL,NULL,NULL,NULL,37.37846421,126.7852738,'해법장곡이지학원','학원',NULL,'8:00~22:00','1588-8069',NULL),(39,'경기도 화성시 동탄순환대로10길 42','254-22-01078',NULL,NULL,NULL,NULL,37.16651861,127.1217557,'선한커피','카페/디저트',NULL,'8:00~22:00','1588-8069',NULL),(40,'경기도 안산시 단원구 광덕4로 112','153-02-02780',NULL,NULL,NULL,NULL,37.31515099,126.824769,'국수타래','음식점',NULL,'8:00~22:00','1588-8069',NULL),(41,'경기도 김포시 금포로 1117-20','862-31-00945',NULL,NULL,NULL,NULL,37.64528898,126.7066306,'싸커코어','스포츠시설',NULL,'8:00~22:00','1588-8069',NULL),(42,'경기도 남양주시 호평로68번길 5','640-31-00914',NULL,NULL,NULL,NULL,37.65580829,127.248058,'일파스토','음식점',NULL,'8:00~22:00','1588-8069',NULL),(43,'경기도 시흥시 대은로 10','534-56-00228',NULL,NULL,NULL,NULL,37.4398196,126.7931555,'바나나래빗','카페/디저트',NULL,'8:00~22:00','1588-8069',NULL),(44,'경기도 김포시 김포한강2로 262','814-29-00884',NULL,NULL,NULL,NULL,37.64818147,126.6629256,'몽쁘띠','음식점',NULL,'8:00~22:00','1588-8069',NULL),(45,'경기도 의정부시 의정로 182-19','229-21-61826',NULL,NULL,NULL,NULL,37.74923376,127.0349481,'아이엔맘','카페/디저트',NULL,'8:00~22:00','1588-8069',NULL),(46,'경기도 안양시 만안구 장내로149번길 9','123-38-37685',NULL,NULL,NULL,NULL,37.39851999,126.9235191,'반촌대구막창갈매기살','음식점',NULL,'8:00~22:00','1588-8069',NULL),(47,'경기도 고양시 일산동구 백석로86번길 12-3','592-78-00134',NULL,NULL,NULL,NULL,37.6472828,126.7877544,'프로곱창','음식점',NULL,'8:00~22:00','1588-8069',NULL),(48,'경기도 평택시 포승읍 여술2길 15','118-16-63990',NULL,NULL,NULL,NULL,36.98673516,126.8455977,'예만두','음식점',NULL,'8:00~22:00','1588-8069',NULL),(49,'경기도 용인시 기흥구 보정로 117','629-43-00792',NULL,NULL,NULL,NULL,37.31984784,127.1142858,'돈까스짱','음식점',NULL,'8:00~22:00','1588-8069',NULL),(50,'경기도 고양시 덕양구 호국로 1702-2','796-08-02162',NULL,NULL,NULL,NULL,37.7028909,126.9052113,'필립테이블','음식점',NULL,'8:00~22:00','1588-8069',NULL),(51,'경기도 남양주시 호평로 63','319-22-00599',NULL,NULL,NULL,NULL,37.65626995,127.2470283,'라비에벨','생활',NULL,'8:00~22:00','1588-8069',NULL),(52,'경기도 용인시 기흥구 동백5로 21-11','827-03-01593',NULL,NULL,NULL,NULL,37.27739287,127.1526036,'으뜸50안경','의류/잡화',NULL,'8:00~22:00','1588-8069',NULL),(53,'경기도 군포시 군포로 489-2','768-93-01320',NULL,NULL,NULL,NULL,37.35021859,126.9441998,'국무합기도','학원',NULL,'8:00~22:00','1588-8069',NULL),(54,'경기도 남양주시 화도읍 먹갓로서길 1','846-03-01731',NULL,NULL,NULL,NULL,37.65668979,127.2731854,'고기팩트','생활',NULL,'8:00~22:00','1588-8069',NULL),(55,'경기도 고양시 덕양구 신원로2길 62','765-16-00544',NULL,NULL,NULL,NULL,37.66099889,126.8885593,'델리지오소','음식점',NULL,'8:00~22:00','1588-8069',NULL),(56,'경기도 고양시 덕양구 화중로130번길 5-11','729-29-01213',NULL,NULL,NULL,NULL,37.63911096,126.8325991,'마라영웅 화정점','음식점',NULL,'8:00~22:00','1588-8069',NULL),(57,'경기도 의정부시 용현로160번길 14-7','601-34-17269',NULL,NULL,NULL,NULL,37.73990426,127.0929866,'한끼한죽','음식점',NULL,'8:00~22:00','1588-8069',NULL),(58,'경기도 고양시 일산동구 정발산로 24','238-23-00768',NULL,NULL,NULL,NULL,37.65590291,126.7720456,'카페메르시','카페/디저트',NULL,'8:00~22:00','1588-8069',NULL),(59,'경기도 의왕시 어내들로 5','120-48-00698',NULL,NULL,NULL,NULL,37.36159698,126.9631442,'정다방','카페/디저트',NULL,'8:00~22:00','1588-8069',NULL),(60,'경기도 김포시 김포한강2로23번길 72','598-26-01016',NULL,NULL,NULL,NULL,37.64056014,126.6794341,'두리상회','음식점',NULL,'8:00~22:00','1588-8069',NULL),(61,'경기도 고양시 일산서구 성저로 68','699-22-01096',NULL,NULL,NULL,NULL,37.68490633,126.7545546,'드림라운지','음식점',NULL,'8:00~22:00','1588-8069',NULL),(62,'경기도 안산시 단원구 광덕대로 206','454-44-00628',NULL,NULL,NULL,NULL,37.31470083,126.8312116,'프랑킨숯불양념구이치킨 고잔점','음식점',NULL,'8:00~22:00','1588-8069',NULL),(63,'경기도 고양시 일산서구 호수로 817','128-35-55877',NULL,NULL,NULL,NULL,37.6679979,126.7516407,'수라간','음식점',NULL,'8:00~22:00','1588-8069',NULL),(64,'경기도 부천시 소사구 경인로134번길 52','356-02-02360',NULL,NULL,NULL,NULL,37.48177267,126.7698848,'거기','음식점',NULL,'8:00~22:00','1588-8069',NULL),(65,'경기도 화성시 팔탄면 시청로 807','751-60-00363',NULL,NULL,NULL,NULL,37.16759241,126.8797513,'농부손수제비','음식점',NULL,'8:00~22:00','1588-8069',NULL),(66,'경기도 안산시 상록구 샘골로 190','134-33-04442',NULL,NULL,NULL,NULL,37.30069543,126.8635799,'뚜레쥬르안산상록수','카페/디저트',NULL,'8:00~22:00','1588-8069',NULL),(67,'경기도 안성시 미양면 협동단지길 3','222-81-34905',NULL,NULL,NULL,NULL,36.95885766,127.2443867,'같이행복공동체협동조합','학원',NULL,'8:00~22:00','1588-8069',NULL),(68,'경기도 수원시 권선구 칠보로88번길 122','657-01-00614',NULL,NULL,NULL,NULL,37.26394405,126.9433841,'메밀정원','음식점',NULL,'8:00~22:00','1588-8069',NULL),(69,'경기도 시흥시 수인로 3472-22','140-09-90424',NULL,NULL,NULL,NULL,37.44399379,126.7748032,'고구려짬뽕집','음식점',NULL,'8:00~22:00','1588-8069',NULL),(70,'경기도 안산시 단원구 광덕대로 141','720-62-00529',NULL,NULL,NULL,NULL,37.30909314,126.8289455,'뱃살도둑 안산고잔점','음식점',NULL,'8:00~22:00','1588-8069',NULL),(71,'경기도 수원시 영통구 영일로 8','683-29-01106',NULL,NULL,NULL,NULL,37.24842623,127.0760134,'키와마루아지','음식점',NULL,'8:00~22:00','1588-8069',NULL),(72,'경기도 하남시 하남대로802번길 68','206-48-50982',NULL,NULL,NULL,NULL,37.54216489,127.2119133,'용갈집','음식점',NULL,'8:00~22:00','1588-8069',NULL),(73,'경기도 양주시 회천남로 88','735-14-00684',NULL,NULL,NULL,NULL,37.81854948,127.0928012,'생고기제작소','음식점',NULL,'8:00~22:00','1588-8069',NULL),(74,'경기도 용인시 기흥구 서천서로12번길 4-2','735-01-01757',NULL,NULL,NULL,NULL,37.24060664,127.0736839,'타니예르','카페/디저트',NULL,'8:00~22:00','1588-8069',NULL),(75,'경기도 고양시 덕양구 화중로152번길 6-14','325-11-01388',NULL,NULL,NULL,NULL,37.63995876,126.8332204,'열정국밥','음식점',NULL,'8:00~22:00','1588-8069',NULL),(76,'경기도 오산시 오산로278번길 9','433-01-01676',NULL,NULL,NULL,NULL,37.1518915,127.0695902,'브라더돈까스','음식점',NULL,'8:00~22:00','1588-8069',NULL),(77,'경기도 고양시 덕양구 혜음로 8','550-37-01136',NULL,NULL,NULL,NULL,37.70107717,126.9018231,'가마치통닭 고양점','음식점',NULL,'8:00~22:00','1588-8069',NULL),(78,'경기도 부천시 원미구 길주로 71','898-73-00250',NULL,NULL,NULL,NULL,37.50639388,126.7505258,'길로마중','음식점',NULL,'8:00~22:00','1588-8069',NULL),(79,'경기도 부천시 원미구 부천로3번길 41','116-02-12009',NULL,NULL,NULL,NULL,37.48492842,126.780526,'고깃집','음식점',NULL,'8:00~22:00','1588-8069',NULL),(80,'경기도 수원시 영통구 권선로882번길 65-17','427-54-00227',NULL,NULL,NULL,NULL,37.24736165,127.0427851,'유마카롱','카페/디저트',NULL,'8:00~22:00','1588-8069',NULL),(81,'경기도 안산시 단원구 초지로 90','613-93-08514',NULL,NULL,NULL,NULL,37.30673866,126.8151103,'맨투맨영수학원','학원',NULL,'8:00~22:00','1588-8069',NULL),(82,'경기도 성남시 분당구 불정로420번길 17-1','419-60-00514',NULL,NULL,NULL,NULL,37.37554692,127.1416136,'중화','음식점',NULL,'8:00~22:00','1588-8069',NULL),(83,'경기도 남양주시 별내면 청학로92번길 29','391-60-00432',NULL,NULL,NULL,NULL,37.71081713,127.1174126,'꼬꼬스토리','음식점',NULL,'8:00~22:00','1588-8069',NULL),(84,'경기도 동두천시 평화로2261번길 9-6','368-01-02712',NULL,NULL,NULL,NULL,37.88943264,127.055875,'청년다방','음식점',NULL,'8:00~22:00','1588-8069',NULL),(85,'경기도 광주시 경안안길 5','212-29-70380',NULL,NULL,NULL,NULL,37.41451277,127.2518914,'김찌개','음식점',NULL,'8:00~22:00','1588-8069',NULL),(86,'경기도 용인시 처인구 한터로152번길 2','668-11-00933',NULL,NULL,NULL,NULL,37.24848523,127.2270595,'션하게마시자','음식점',NULL,'8:00~22:00','1588-8069',NULL),(87,'경기도 파주시 문산읍 문향로75번길 124','734-14-00997',NULL,NULL,NULL,NULL,37.86206293,126.782242,'미소가와 문산점','음식점',NULL,'8:00~22:00','1588-8069',NULL),(88,'경기도 파주시 산내로 106-1','626-13-01631',NULL,NULL,NULL,NULL,37.72716155,126.7376384,'운정초밥좋은날','음식점',NULL,'8:00~22:00','1588-8069',NULL),(89,'경기도 용인시 처인구 명지로40번길 15-17','859-01-01354',NULL,NULL,NULL,NULL,37.23103949,127.1866654,'이태리부엌','음식점',NULL,'8:00~22:00','1588-8069',NULL),(90,'경기도 수원시 권선구 금곡로102번길 30','612-16-61252',NULL,NULL,NULL,NULL,37.27286327,126.941145,'봄봄공방','학원',NULL,'8:00~22:00','1588-8069',NULL),(91,'경기도 시흥시 동서로 1071','111-53-01469',NULL,NULL,NULL,NULL,37.38456789,126.8598374,'안경스케치','의류/잡화',NULL,'8:00~22:00','1588-8069',NULL),(92,'경기도 김포시 김포한강4로 162','458-29-01325',NULL,NULL,NULL,NULL,37.64697786,126.6642228,'라움','미용',NULL,'8:00~22:00','1588-8069',NULL),(93,'경기도 의정부시 용민로 477','515-10-03793',NULL,NULL,NULL,NULL,37.75144124,127.1180554,'포이남','음식점',NULL,'8:00~22:00','1588-8069',NULL),(94,'경기도 파주시 후곡로 21','223-22-01133',NULL,NULL,NULL,NULL,37.75549107,126.7739305,'윤이불닭발','음식점',NULL,'8:00~22:00','1588-8069',NULL),(95,'경기도 안산시 상록구 본삼로 45','134-31-57834',NULL,NULL,NULL,NULL,37.30109362,126.8650906,'홍차부부사진가게','생활',NULL,'8:00~22:00','1588-8069',NULL),(96,'경기도 시흥시 서울대학로 328','406-69-00388',NULL,NULL,NULL,NULL,37.37409762,126.7297846,'해필리','음식점',NULL,'8:00~22:00','1588-8069',NULL),(97,'경기도 안성시 비룡3길 6','296-26-00498',NULL,NULL,NULL,NULL,37.01389491,127.2657436,'배떡 안성점','음식점',NULL,'8:00~22:00','1588-8069',NULL),(98,'경기도 화성시 동탄대로21길 10','375-37-01189',NULL,NULL,NULL,NULL,37.20770076,127.0980072,'자매꿈과자','카페/디저트',NULL,'8:00~22:00','1588-8069',NULL),(99,'경기도 시흥시 은행로 149','854-95-01004',NULL,NULL,NULL,NULL,37.44439826,126.7992565,'거인미술학원','학원',NULL,'8:00~22:00','1588-8069',NULL),(100,'경기도 평택시 서정역로 48','429-71-00365',NULL,NULL,NULL,NULL,37.05828725,127.0553159,'서정부부약국','의료시설',NULL,'8:00~22:00','1588-8069',NULL),(101,'경기도 양평군 서종면 북한강로 755','410-41-00758',NULL,NULL,NULL,NULL,37.60425828,127.3495598,'별강정','음식점',NULL,'8:00~22:00','1588-8069',NULL),(102,'경기도 성남시 분당구 판교역로192번길 14-2','144-02-39245',NULL,NULL,NULL,NULL,37.39747349,127.1120432,'매일식당','음식점',NULL,'8:00~22:00','1588-8069',NULL),(103,'경기도 의정부시 평화로 220','201-23-04350',NULL,NULL,NULL,NULL,37.71164965,127.048052,'랑차이','음식점',NULL,'8:00~22:00','1588-8069',NULL),(104,'경기도 용인시 수지구 풍덕천로148번길 6','516-13-01367',NULL,NULL,NULL,NULL,37.32370985,127.098011,'버텍스 수지구청점','음식점',NULL,'8:00~22:00','1588-8069',NULL),(105,'경기도 화성시 동탄순환대로 127-17','624-13-02008',NULL,NULL,NULL,NULL,37.1669561,127.1072771,'공감식탁','음식점',NULL,'8:00~22:00','1588-8069',NULL),(106,'경기도 안산시 단원구 광덕대로 138','121-28-62267',NULL,NULL,NULL,NULL,37.30869909,126.8306159,'삼백돈돈가츠 안산고잔점','음식점',NULL,'8:00~22:00','1588-8069',NULL),(107,'경기도 화성시 효행로 1037','614-24-63246',NULL,NULL,NULL,NULL,37.21370827,127.0406931,'등촌샤브칼국수','음식점',NULL,'8:00~22:00','1588-8069',NULL),(108,'경기도 성남시 분당구 돌마로 75','399-29-00823',NULL,NULL,NULL,NULL,37.35039643,127.1104495,'서울더믿음치과','의료시설',NULL,'8:00~22:00','1588-8069',NULL),(109,'경기도 고양시 일산동구 무궁화로 20-11','117-21-91032',NULL,NULL,NULL,NULL,37.6618316,126.7675508,'피앤피모바일','생활',NULL,'8:00~22:00','1588-8069',NULL),(110,'경기도 화성시 남양읍 시청로202번길 74-27','210-24-41550',NULL,NULL,NULL,NULL,37.19651561,126.8280847,'기와집옛날국수','음식점',NULL,'8:00~22:00','1588-8069',NULL),(111,'경기도 평택시 안중읍 안현로서9길 20-4','218-05-10268',NULL,NULL,NULL,NULL,36.97805191,126.9227739,'삼대불족발','족발/보쌈',NULL,'8:00~22:00','1588-8069',NULL),(112,'경기도 남양주시 다산순환로 118-17','319-57-00422',NULL,NULL,NULL,NULL,37.62123478,127.1476287,'맛창꼬','음식점',NULL,'8:00~22:00','1588-8069',NULL),(113,'경기도 시흥시 서울대학로264번길 7','782-15-02161',NULL,NULL,NULL,NULL,37.36914245,126.7260656,'달붕','카페/디저트',NULL,'8:00~22:00','1588-8069',NULL),(115,'경기도 김포시 초당로16번길 114-6','348-65-00478',NULL,NULL,NULL,NULL,37.63946257,126.6734566,'오토스트','카페/디저트',NULL,'8:00~22:00','1588-8069',NULL),(116,'경기도 구리시 갈매순환로 194','252-61-00301',NULL,NULL,NULL,NULL,37.63659904,127.1218049,'신나는바다','음식점',NULL,'8:00~22:00','1588-8069',NULL),(117,'경기도 성남시 중원구 원터로 106','549-57-00718',NULL,NULL,NULL,NULL,37.43628357,127.1425189,'피자스웨그 성남점','음식점',NULL,'8:00~22:00','1588-8069',NULL),(118,'경기도 시흥시 중심상가로 317','780-03-00994',NULL,NULL,NULL,NULL,37.33759152,126.747666,'신의주찹쌀순대','음식점',NULL,'8:00~22:00','1588-8069',NULL),(119,'경기도 시흥시 함송로14번길 13-9','491-15-01742',NULL,NULL,NULL,NULL,37.36286074,126.7292944,'옹기종기','음식점',NULL,'8:00~22:00','1588-8069',NULL),(120,'경기도 안양시 동안구 관평로 183','835-21-01415',NULL,NULL,NULL,NULL,37.39309562,126.959515,'살롱드라움','미용',NULL,'8:00~22:00','1588-8069',NULL),(121,'경기도 오산시 수청로 80-3','840-06-02562',NULL,NULL,NULL,NULL,37.17552492,127.0549396,'카페더로드865 세교점','카페/디저트',NULL,'8:00~22:00','1588-8069',NULL),(122,'경기도 수원시 장안구 장안로75번길 43','640-26-01068',NULL,NULL,NULL,NULL,37.29023192,127.0004962,'사계절멸치국수N보쌈','족발/보쌈',NULL,'8:00~22:00','1588-8069',NULL),(123,'경기도 고양시 일산동구 중앙로 1305-30','205-08-14779',NULL,NULL,NULL,NULL,37.66151136,126.7696484,'임창정파절이세겹살 일산점','음식점',NULL,'8:00~22:00','1588-8069',NULL),(124,'경기도 고양시 덕양구 마상로140번길 62','102-03-82430',NULL,NULL,NULL,NULL,37.65731522,126.8357427,'우리집으로','음식점',NULL,'8:00~22:00','1588-8069',NULL),(125,'경기도 안양시 만안구 안양로329번길 18','411-47-00786',NULL,NULL,NULL,NULL,37.40096729,126.9183213,'서희생선구이밥상','음식점',NULL,'8:00~22:00','1588-8069',NULL),(126,'경기도 광명시 오리로856번길 12','298-19-01286',NULL,NULL,NULL,NULL,37.47503056,126.8682266,'히어로보드게임카페 철산점','취미/여가',NULL,'8:00~22:00','1588-8069',NULL),(127,'경기도 성남시 분당구 판교공원로5길 35','810-35-00296',NULL,NULL,NULL,NULL,37.39058261,127.0884994,'미스터신돈까스','음식점',NULL,'8:00~22:00','1588-8069',NULL),(128,'경기도 안산시 상록구 충장로 80','894-18-00865',NULL,NULL,NULL,NULL,37.28869543,126.8574667,'시골순대','음식점',NULL,'8:00~22:00','1588-8069',NULL),(129,'경기도 파주시 월롱면 엘씨디로 201','660-96-01425',NULL,NULL,NULL,NULL,37.80856915,126.7614704,'정다운치과의원','의료시설',NULL,'8:00~22:00','1588-8069',NULL),(130,'경기도 성남시 분당구 야탑로149번길 5','353-07-02139',NULL,NULL,NULL,NULL,37.41021657,127.1353421,'애프터선데이클럽','미용',NULL,'8:00~22:00','1588-8069',NULL),(131,'경기도 고양시 일산동구 정발산로 24','418-19-01366',NULL,NULL,NULL,NULL,37.65590291,126.7720456,'일공공샤브','음식점',NULL,'8:00~22:00','1588-8069',NULL),(132,'경기도 시흥시 정왕대로 78','384-16-00480',NULL,NULL,NULL,NULL,37.35312879,126.7250064,'한촌설렁탕','음식점',NULL,'8:00~22:00','1588-8069',NULL),(133,'경기도 오산시 오산로50번길 24','523-07-01350',NULL,NULL,NULL,NULL,37.13103132,127.0706515,'사진찍기좋은날','생활',NULL,'8:00~22:00','1588-8069',NULL),(134,'경기도 성남시 분당구 불곡로3번길 4','385-25-01562',NULL,NULL,NULL,NULL,37.35955593,127.1235568,'멸치국수맛있는집','음식점',NULL,'8:00~22:00','1588-8069',NULL),(135,'경기도 의정부시 오목로 196','362-07-02259',NULL,NULL,NULL,NULL,37.7439805,127.0993,'점프 의정부점','카페/디저트',NULL,'8:00~22:00','1588-8069',NULL),(136,'경기도 동두천시 장고갯로 283','155-54-00230',NULL,NULL,NULL,NULL,37.91640604,127.0576809,'크랙치킨','음식점',NULL,'8:00~22:00','1588-8069',NULL),(137,'경기도 가평군 청평면 경춘로 221-12','303-51-00032',NULL,NULL,NULL,NULL,37.69579364,127.3827916,'둥지칼국수','음식점',NULL,'8:00~22:00','1588-8069',NULL),(138,'경기도 평택시 팽성읍 송화택지로 146','392-18-01543',NULL,NULL,NULL,NULL,36.96334448,127.0650164,'뜰쌈밥','음식점',NULL,'8:00~22:00','1588-8069',NULL),(139,'경기도 의정부시 가능로125번길 28','726-55-00932',NULL,NULL,NULL,NULL,37.74829343,127.0447511,'아국오국','음식점',NULL,'8:00~22:00','1588-8069',NULL),(140,'경기도 하남시 하남대로 231','493-17-02187',NULL,NULL,NULL,NULL,37.49611308,127.2319572,'주양한식뷔페','음식점',NULL,'8:00~22:00','1588-8069',NULL),(141,'경기도 부천시 원미구 부흥로 177','483-35-01415',NULL,NULL,NULL,NULL,37.4966424,126.7623643,'중식당','음식점',NULL,'8:00~22:00','1588-8069',NULL),(142,'경기도 안양시 동안구 학의로 282','814-88-01406',NULL,NULL,NULL,NULL,37.40106356,126.9691333,'치킨아메리카Z 평촌점','음식점',NULL,'8:00~22:00','1588-8069',NULL),(143,'경기도 동두천시 평화로2313번길 8-35','786-22-01691',NULL,NULL,NULL,NULL,37.89600899,127.0570283,'덱스터버거','음식점',NULL,'8:00~22:00','1588-8069',NULL),(144,'경기도 이천시 영창로 148','422-16-01933',NULL,NULL,NULL,NULL,37.2817592,127.4389598,'알찬집','음식점',NULL,'8:00~22:00','1588-8069',NULL),(145,'경기도 화성시 향남읍 상신하길로328번길 8-13','875-04-03199',NULL,NULL,NULL,NULL,37.11670178,126.9119554,'야들야들한보약족발보쌈 향남점','음식점',NULL,'8:00~22:00','1588-8069',NULL),(146,'경기도 양주시 부흥로 1936','317-32-01024',NULL,NULL,NULL,NULL,37.79467586,127.0778866,'모닉','의류/잡화',NULL,'8:00~22:00','1588-8069',NULL),(147,'경기도 고양시 일산동구 무궁화로 42-38','634-10-01704',NULL,NULL,NULL,NULL,37.6618458,126.7702027,'한뫼당','음식점',NULL,'8:00~22:00','1588-8069',NULL),(148,'경기도 하남시 역말로 47-1','846-65-00216',NULL,NULL,NULL,NULL,37.53620882,127.2018945,'신전떡볶이','음식점',NULL,'8:00~22:00','1588-8069',NULL),(149,'경기도 평택시 쇼핑로 23-1','619-05-65248',NULL,NULL,NULL,NULL,37.08113991,127.052026,'카레야','음식점',NULL,'8:00~22:00','1588-8069',NULL),(150,'경기도 고양시 일산동구 위시티2로11번길 16','806-53-00137',NULL,NULL,NULL,NULL,37.67732753,126.8126076,'고종의뜰','카페/디저트',NULL,'8:00~22:00','1588-8069',NULL),(151,'경기도 평택시 진위면 진위서로 176','502-36-80891',NULL,NULL,NULL,NULL,37.10474002,127.0819332,'다룡짬뽕','음식점',NULL,'8:00~22:00','1588-8069',NULL),(152,'경기도 고양시 덕양구 권율대로 890','657-25-01846',NULL,NULL,NULL,NULL,37.66297331,126.8899164,'초마맨1981','음식점',NULL,'8:00~22:00','1588-8069',NULL),(153,'경기도 남양주시 경강로 377','248-43-00706',NULL,NULL,NULL,NULL,37.59245251,127.1997818,'파스타아미고 한강점','음식점',NULL,'8:00~22:00','1588-8069',NULL),(154,'경기도 광주시 광주대로 52','859-37-00505',NULL,NULL,NULL,NULL,37.4113038,127.2608268,'청춘수산','음식점',NULL,'8:00~22:00','1588-8069',NULL),(155,'경기도 용인시 수지구 현암로 165','142-05-42819',NULL,NULL,NULL,NULL,37.33188998,127.1276639,'떡마을','카페/디저트',NULL,'8:00~22:00','1588-8069',NULL),(156,'경기도 양평군 용문면 다문중앙1길 15','519-43-00520',NULL,NULL,NULL,NULL,37.48471397,127.5916633,'포스트레','카페/디저트',NULL,'8:00~22:00','1588-8069',NULL),(157,'경기도 과천시 별양상가2로 20','537-86-01413',NULL,NULL,NULL,NULL,37.42682749,126.9925547,'수작협동조합','학원',NULL,'8:00~22:00','1588-8069',NULL),(158,'경기도 양주시 고읍남로 32','886-04-00528',NULL,NULL,NULL,NULL,37.79397276,127.0784081,'현우헤어공간','미용',NULL,'8:00~22:00','1588-8069',NULL),(159,'경기도 양주시 고암길 64','127-92-53845',NULL,NULL,NULL,NULL,37.83165637,127.0695876,'위더스학원','학원',NULL,'8:00~22:00','1588-8069',NULL),(160,'경기도 시흥시 배곧5로 78','502-37-52505',NULL,NULL,NULL,NULL,37.38240066,126.7358182,'돈까스엔파스타','음식점',NULL,'8:00~22:00','1588-8069',NULL),(161,'경기도 시흥시 거북섬로 211','684-42-00910',NULL,NULL,NULL,NULL,37.322888,126.6877722,'차이시룽','음식점',NULL,'8:00~22:00','1588-8069',NULL),(162,'경기도 시흥시 시청로72번길 16','670-19-00586',NULL,NULL,NULL,NULL,37.38164548,126.8011062,'뜨는청국장시대','음식점',NULL,'8:00~22:00','1588-8069',NULL),(163,'경기도 수원시 팔달구 정조로900번길 13','740-16-02086',NULL,NULL,NULL,NULL,37.28795128,127.0154722,'백스트리트피자','음식점',NULL,'8:00~22:00','1588-8069',NULL),(164,'경기도 광명시 오리로854번길 24','191-11-02353',NULL,NULL,NULL,NULL,37.47486073,126.8694592,'크랩포차 철산점','음식점',NULL,'8:00~22:00','1588-8069',NULL),(165,'경기도 안양시 동안구 관평로 76','260-54-00740',NULL,NULL,NULL,NULL,37.38434852,126.9652784,'나는통닭','음식점',NULL,'8:00~22:00','1588-8069',NULL),(166,'경기도 파주시 경의로 1016','809-77-00471',NULL,NULL,NULL,NULL,37.70825164,126.7594448,'라와마라탕 야당점','음식점',NULL,'8:00~22:00','1588-8069',NULL),(167,'경기도 남양주시 와부읍 수레로1번길 23','619-14-17054',NULL,NULL,NULL,NULL,37.58841994,127.2130294,'카페마노아','카페/디저트',NULL,'8:00~22:00','1588-8069',NULL),(168,'경기도 화성시 동탄대로시범길 193','363-92-01851',NULL,NULL,NULL,NULL,37.20141125,127.1085424,'반달음악학원','학원',NULL,'8:00~22:00','1588-8069',NULL),(169,'경기도 양주시 화합로 1361','479-47-00953',NULL,NULL,NULL,NULL,37.84357097,127.0624867,'병아리스낵','음식점',NULL,'8:00~22:00','1588-8069',NULL),(170,'경기도 오산시 성호대로 123','805-06-02628',NULL,NULL,NULL,NULL,37.1490317,127.0752271,'제이디핫독','음식점',NULL,'8:00~22:00','1588-8069',NULL),(171,'경기도 부천시 오정구 원종로 106','764-27-01041',NULL,NULL,NULL,NULL,37.52391488,126.811872,'빠앙','카페/디저트',NULL,'8:00~22:00','1588-8069',NULL),(172,'경기도 수원시 장안구 송정로187번길 75','612-36-01169',NULL,NULL,NULL,NULL,37.3013139,127.0136026,'찐스뉴욕베이글','카페/디저트',NULL,'8:00~22:00','1588-8069',NULL),(173,'경기도 안산시 단원구 광덕1로 193','288-10-02214',NULL,NULL,NULL,NULL,37.30819533,126.8311923,'고피자 안산고잔점','음식점',NULL,'8:00~22:00','1588-8069',NULL),(174,'경기도 수원시 영통구 청명남로4번길 5-4','571-64-00260',NULL,NULL,NULL,NULL,37.25037377,127.0739864,'양푼애등갈비','음식점',NULL,'8:00~22:00','1588-8069',NULL),(175,'경기도 안산시 상록구 부곡로 32','457-16-01661',NULL,NULL,NULL,NULL,37.32543334,126.8597442,'오늘두탈모피하자','미용',NULL,'8:00~22:00','1588-8069',NULL),(176,'경기도 양주시 옥정동로4길 11','734-24-00813',NULL,NULL,NULL,NULL,37.81455263,127.099667,'옆집컴퓨터','생활',NULL,'8:00~22:00','1588-8069',NULL),(177,'경기도 수원시 장안구 송정로 58-1','274-22-00374',NULL,NULL,NULL,NULL,37.29588138,127.003485,'이지다헤어','미용',NULL,'8:00~22:00','1588-8069',NULL),(178,'경기도 광명시 소하로 81','355-04-01659',NULL,NULL,NULL,NULL,37.44763834,126.8840171,'어부의밥상','음식점',NULL,'8:00~22:00','1588-8069',NULL),(179,'경기도 성남시 분당구 판교공원로2길 55','326-38-00512',NULL,NULL,NULL,NULL,37.38986816,127.0919653,'후안즈','음식점',NULL,'8:00~22:00','1588-8069',NULL),(180,'경기도 의정부시 평화로 630','127-92-89815',NULL,NULL,NULL,NULL,37.74811292,127.0455907,'민들레한의원','의료시설',NULL,'8:00~22:00','1588-8069',NULL),(181,'경기도 용인시 처인구 양지면 양지로 161','789-08-00676',NULL,NULL,NULL,NULL,37.23437276,127.2862477,'우리집손만두','음식점',NULL,'8:00~22:00','1588-8069',NULL),(182,'경기도 시흥시 남왕길 48-18','196-32-00942',NULL,NULL,NULL,NULL,37.38271531,126.8628443,'마왕족발 시흥목감점','족발/보쌈',NULL,'8:00~22:00','1588-8069',NULL),(183,'경기도 파주시 문산읍 방촌로 1719-57','321-14-00506',NULL,NULL,NULL,NULL,37.8670759,126.7842502,'황금참치','음식점',NULL,'8:00~22:00','1588-8069',NULL),(184,'경기도 김포시 풍무로146번길 52-9','777-05-03155',NULL,NULL,NULL,NULL,37.6070277,126.7268604,'고기굼터육방','음식점',NULL,'8:00~22:00','1588-8069',NULL),(185,'경기도 파주시 중앙로 264','210-32-51640',NULL,NULL,NULL,NULL,37.75983209,126.7778098,'중식당','음식점',NULL,'8:00~22:00','1588-8069',NULL),(186,'경기도 의정부시 평화로 630','637-55-00796',NULL,NULL,NULL,NULL,37.74811292,127.0455907,'노모어피자 가능역점','음식점',NULL,'8:00~22:00','1588-8069',NULL),(187,'경기도 오산시 가수안길 13','339-14-01879',NULL,NULL,NULL,NULL,37.14426906,127.0508311,'교동짬뽕 오산점','음식점',NULL,'8:00~22:00','1588-8069',NULL),(188,'경기도 화성시 동탄첨단산업1로 58','171-78-00368',NULL,NULL,NULL,NULL,37.21393184,127.0919879,'초이닭칼국수','음식점',NULL,'8:00~22:00','1588-8069',NULL),(189,'경기도 화성시 왕배산2길 4-10','120-33-01373',NULL,NULL,NULL,NULL,37.18096846,127.1247181,'레터인케이크','카페/디저트',NULL,'8:00~22:00','1588-8069',NULL),(191,'경기도 고양시 덕양구 권율대로 896-17','134-85-60690',NULL,NULL,NULL,NULL,37.66281296,126.8918887,'행복한진짓상','음식점',NULL,'8:00~22:00','1588-8069',NULL),(192,'경기도 화성시 팔탄면 서촌길21번길 8','397-08-02062',NULL,NULL,NULL,NULL,37.1618201,126.9032229,'대지식당','음식점',NULL,'8:00~22:00','1588-8069',NULL),(193,'경기도 의정부시 추동로1번길 31','199-29-01519',NULL,NULL,NULL,NULL,37.74400004,127.055947,'동오짬뽕','음식점',NULL,'8:00~22:00','1588-8069',NULL),(194,'경기도 용인시 기흥구 기흥로30번길 10-12','793-24-01766',NULL,NULL,NULL,NULL,37.27797409,127.1169399,'호민범','음식점',NULL,'8:00~22:00','1588-8069',NULL),(195,'경기도 평택시 비전9길 5','549-29-00277',NULL,NULL,NULL,NULL,37.00267155,127.1090794,'이정칼국수모밀','음식점',NULL,'8:00~22:00','1588-8069',NULL),(196,'경기도 하남시 미사강변중앙로 193','629-04-02525',NULL,NULL,NULL,NULL,37.56375463,127.1896203,'호미불닭발 하남점','음식점',NULL,'8:00~22:00','1588-8069',NULL),(197,'경기도 파주시 문산읍 당동1로 25-30','698-31-01440',NULL,NULL,NULL,NULL,37.86115503,126.7737786,'배무치숯불두마리치킨','음식점',NULL,'8:00~22:00','1588-8069',NULL),(198,'경기도 구리시 갈매순환로204번길 20','697-43-00984',NULL,NULL,NULL,NULL,37.63759869,127.1222257,'차분헤어','미용',NULL,'8:00~22:00','1588-8069',NULL),(199,'경기도 성남시 분당구 판교로255번길 9-22','379-05-01875',NULL,NULL,NULL,NULL,37.40402562,127.100092,'서호돈가스','음식점',NULL,'8:00~22:00','1588-8069',NULL),(200,'경기도 양주시 옥정동로5길 28','347-25-01745',NULL,NULL,NULL,NULL,37.81649152,127.0974777,'킴스쿠치나','음식점',NULL,'8:00~22:00','1588-8069',NULL),(201,'경기도 화성시 향남읍 행정서로3길 4-56','438-32-01340',NULL,NULL,NULL,NULL,37.13005971,126.9177581,'셀렉토커피 화성향남점','카페/디저트',NULL,'8:00~22:00','1588-8069',NULL),(202,'경기도 수원시 팔달구 덕영대로697번길 17','608-96-10192',NULL,NULL,NULL,NULL,37.28493347,126.9909561,'레몬트리기타교습소','학원',NULL,'8:00~22:00','1588-8069',NULL),(203,'경기도 용인시 수지구 풍덕천로22번길 28','832-43-00137',NULL,NULL,NULL,NULL,37.3164499,127.0831327,'7번가피자 수지상현점','음식점',NULL,'8:00~22:00','1588-8069',NULL),(204,'경기도 성남시 분당구 내정로165번길 38','121-38-91591',NULL,NULL,NULL,NULL,37.37664657,127.1164719,'수내통닭','음식점',NULL,'8:00~22:00','1588-8069',NULL),(205,'경기도 용인시 수지구 만현로 103','822-03-02471',NULL,NULL,NULL,NULL,37.30738385,127.0854464,'안경매니져 상현점','의류/잡화',NULL,'8:00~22:00','1588-8069',NULL),(206,'경기도 광주시 신현로12번길 13','311-90-80943',NULL,NULL,NULL,NULL,37.35855399,127.1486139,'경기광주신현필아트미술학원','학원',NULL,'8:00~22:00','1588-8069',NULL),(207,'경기도 수원시 권선구 호매실로 100','147-80-80235',NULL,NULL,NULL,NULL,37.25572517,126.9626435,'헤어살롱단장','미용',NULL,'8:00~22:00','1588-8069',NULL),(208,'경기도 김포시 김포한강11로 288-19','157-95-01617',NULL,NULL,NULL,NULL,37.6547137,126.6824557,'에듀앤더교습소','학원',NULL,'8:00~22:00','1588-8069',NULL),(209,'경기도 화성시 동탄반석로 124','235-08-00596',NULL,NULL,NULL,NULL,37.20000671,127.0715267,'동탄리요가','학원',NULL,'8:00~22:00','1588-8069',NULL),(210,'경기도 양주시 부흥로 1932','439-43-00831',NULL,NULL,NULL,NULL,37.79444178,127.0776366,'삼대돈카츠','음식점',NULL,'8:00~22:00','1588-8069',NULL),(211,'경기도 남양주시 진접읍 장현로107번길 1','822-25-00062',NULL,NULL,NULL,NULL,37.71967056,127.1834272,'아시카페','카페/디저트',NULL,'8:00~22:00','1588-8069',NULL),(212,'경기도 고양시 일산서구 현중로36번길 77','532-09-01061',NULL,NULL,NULL,NULL,37.69459977,126.7719839,'더평안','카페/디저트',NULL,'8:00~22:00','1588-8069',NULL),(213,'경기도 광명시 오리로 649','203-13-22883',NULL,NULL,NULL,NULL,37.45910119,126.8770482,'모둘리','미용',NULL,'8:00~22:00','1588-8069',NULL),(214,'경기도 평택시 문화촌로19번길 7-6','305-70-08972',NULL,NULL,NULL,NULL,36.99714308,127.1142167,'모꼬지','음식점',NULL,'8:00~22:00','1588-8069',NULL),(215,'경기도 고양시 일산동구 강송로 33','763-10-02016',NULL,NULL,NULL,NULL,37.64406626,126.7928057,'북촌손만두','음식점',NULL,'8:00~22:00','1588-8069',NULL),(216,'경기도 평택시 안중읍 송담2로 55','584-41-00743',NULL,NULL,NULL,NULL,36.98026351,126.929095,'서양밥집','카페/디저트',NULL,'8:00~22:00','1588-8069',NULL),(217,'경기도 평택시 평택로64번길 46','125-24-32786',NULL,NULL,NULL,NULL,36.99472422,127.0869938,'꿀단지텔레콤','생활',NULL,'8:00~22:00','1588-8069',NULL),(218,'경기도 평택시 청북읍 안청로 340','237-34-00816',NULL,NULL,NULL,NULL,37.01830743,126.915665,'아이굿안경','의류/잡화',NULL,'8:00~22:00','1588-8069',NULL),(219,'경기도 여주시 가남읍 태평1길 18-1','720-33-01213',NULL,NULL,NULL,NULL,37.20456924,127.5487141,'신아띠마라탕','음식점',NULL,'8:00~22:00','1588-8069',NULL),(220,'경기도 고양시 덕양구 충장로282번길 128','826-54-00405',NULL,NULL,NULL,NULL,37.64109868,126.8431998,'1982성북동왕돈까스','음식점',NULL,'8:00~22:00','1588-8069',NULL),(221,'경기도 구리시 안골로8번길 67','763-11-00688',NULL,NULL,NULL,NULL,37.59458299,127.1329124,'따세비어','음식점',NULL,'8:00~22:00','1588-8069',NULL),(222,'경기도 김포시 김포한강9로75번길 102','234-01-28379',NULL,NULL,NULL,NULL,37.64397831,126.6227206,'카페몽몽','카페/디저트',NULL,'8:00~22:00','1588-8069',NULL),(223,'경기도 안양시 동안구 귀인로 209','716-09-01112',NULL,NULL,NULL,NULL,37.38630281,126.9622513,'슈퍼맨인테리어디자인','생활',NULL,'8:00~22:00','1588-8069',NULL),(224,'경기도 의정부시 용민로 70','752-24-01674',NULL,NULL,NULL,NULL,37.73697231,127.0861306,'덮밥카노','음식점',NULL,'8:00~22:00','1588-8069',NULL),(225,'경기도 수원시 영통구 태장로71번길 8','104-13-93719',NULL,NULL,NULL,NULL,37.23977914,127.0542987,'뽕짝','음식점',NULL,'8:00~22:00','1588-8069',NULL),(226,'경기도 수원시 권선구 권중로56번길 39','680-45-00791',NULL,NULL,NULL,NULL,37.25307841,127.029138,'본만두 권선점','음식점',NULL,'8:00~22:00','1588-8069',NULL),(227,'경기도 부천시 원미구 상일로122번길 19','726-09-01856',NULL,NULL,NULL,NULL,37.49052954,126.755961,'아침식빵','카페/디저트',NULL,'8:00~22:00','1588-8069',NULL),(228,'경기도 안산시 단원구 광덕2로 156-5','157-26-01488',NULL,NULL,NULL,NULL,37.30934381,126.8278282,'강력풍천장어','음식점',NULL,'8:00~22:00','1588-8069',NULL),(229,'경기도 안산시 상록구 성안길 84-1','381-01-01093',NULL,NULL,NULL,NULL,37.3010965,126.838596,'앤의식탁','음식점',NULL,'8:00~22:00','1588-8069',NULL),(230,'경기도 남양주시 진접읍 장현로 77','224-03-21072',NULL,NULL,NULL,NULL,37.71761125,127.1808928,'한빛안경원','의류/잡화',NULL,'8:00~22:00','1588-8069',NULL),(231,'경기도 시흥시 은계번영길 7','239-51-00541',NULL,NULL,NULL,NULL,37.43710404,126.8016262,'유미카츠 은계점','음식점',NULL,'8:00~22:00','1588-8069',NULL),(232,'경기도 파주시 번영로 56','119-24-00635',NULL,NULL,NULL,NULL,37.75791,126.76691,'잇쇼니키친','음식점',NULL,'8:00~22:00','1588-8069',NULL),(233,'경기도 구리시 동구릉로148번길 24-34','854-46-00327',NULL,NULL,NULL,NULL,37.61137042,127.1390129,'동구짬뽕','음식점',NULL,'8:00~22:00','1588-8069',NULL),(234,'경기도 화성시 동탄대로24길 198','570-40-00989',NULL,NULL,NULL,NULL,37.20591006,127.1153641,'오늘찬','생활',NULL,'8:00~22:00','1588-8069',NULL),(235,'경기도 남양주시 경춘로 368','713-13-01051',NULL,NULL,NULL,NULL,37.60461027,127.1556364,'카페디셈버','카페/디저트',NULL,'8:00~22:00','1588-8069',NULL),(236,'경기도 고양시 일산동구 중앙로1275번길 38-5','405-11-43379',NULL,NULL,NULL,NULL,37.65946758,126.7703914,'라와마라탕 일산점','음식점',NULL,'8:00~22:00','1588-8069',NULL),(237,'경기도 하남시 대청로116번길 59-1','126-19-66214',NULL,NULL,NULL,NULL,37.53708722,127.2244015,'코사마트','생활',NULL,'8:00~22:00','1588-8069',NULL),(238,'경기도 화성시 우정읍 조암북로68번나길 3-1','154-03-01175',NULL,NULL,NULL,NULL,37.08622612,126.8221257,'통하자체인사업국','의류/잡화',NULL,'8:00~22:00','1588-8069',NULL),(239,'경기도 화성시 동탄하나3길 3-1','346-25-00573',NULL,NULL,NULL,NULL,37.21381577,127.0627635,'달달해커피','카페/디저트',NULL,'8:00~22:00','1588-8069',NULL),(240,'경기도 이천시 향교로 31','819-43-00847',NULL,NULL,NULL,NULL,37.28502233,127.4410085,'조개에빠진칼국수','음식점',NULL,'8:00~22:00','1588-8069',NULL),(241,'경기도 부천시 원미구 중동로262번길 38','508-10-91417',NULL,NULL,NULL,NULL,37.50263311,126.7709969,'헤어바이수다','미용',NULL,'8:00~22:00','1588-8069',NULL),(242,'경기도 남양주시 진접읍 진건오남로 1029','424-22-00232',NULL,NULL,NULL,NULL,37.71098536,127.183315,'추오정남원추어탕','음식점',NULL,'8:00~22:00','1588-8069',NULL),(243,'경기도 광명시 범안로 1042','291-17-00453',NULL,NULL,NULL,NULL,37.4618333,126.8790331,'봉추찜닭 하안점','음식점',NULL,'8:00~22:00','1588-8069',NULL),(244,'경기도 남양주시 진접읍 장현천로 51','533-48-00384',NULL,NULL,NULL,NULL,37.72062824,127.1817168,'스윗미나','카페/디저트',NULL,'8:00~22:00','1588-8069',NULL),(245,'경기도 안양시 만안구 병목안로 20','560-43-00343',NULL,NULL,NULL,NULL,37.39895805,126.9183687,'보다안경원','의류/잡화',NULL,'8:00~22:00','1588-8069',NULL),(246,'경기도 평택시 화촌2길 7-15','317-09-01292',NULL,NULL,NULL,NULL,36.99179675,127.0719604,'카페조슈아','카페/디저트',NULL,'8:00~22:00','1588-8069',NULL),(247,'경기도 남양주시 진접읍 장현천로76번길 4','397-61-00297',NULL,NULL,NULL,NULL,37.7228273,127.1812685,'천하장사','음식점',NULL,'8:00~22:00','1588-8069',NULL),(248,'경기도 수원시 권선구 효원로 188','203-22-52754',NULL,NULL,NULL,NULL,37.2638924,127.0224006,'푸릴리 수원권선점','음식점',NULL,'8:00~22:00','1588-8069',NULL),(249,'경기도 안산시 상록구 창말2길 25','261-14-01843',NULL,NULL,NULL,NULL,37.30566294,126.9029599,'돈카츠답다','음식점',NULL,'8:00~22:00','1588-8069',NULL),(250,'경기도 화성시 향남읍 상신하길로328번길 20','291-18-00988',NULL,NULL,NULL,NULL,37.11657635,126.9129232,'복고설렁탕','음식점',NULL,'8:00~22:00','1588-8069',NULL);
/*!40000 ALTER TABLE `store` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `store_proposal`
--

DROP TABLE IF EXISTS `store_proposal`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `store_proposal` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `business_number` varchar(255) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `created_at` datetime(6) DEFAULT NULL,
  `reason` varchar(255) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `status` enum('APPROVED','REJECTED','VOTING') COLLATE utf8mb4_general_ci DEFAULT NULL,
  `store_address` varchar(255) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `store_name` varchar(255) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `user_id` bigint DEFAULT NULL,
  `likes` varchar(45) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `dislikes` varchar(45) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `commets` varchar(45) COLLATE utf8mb4_general_ci DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `FKtfcyk7kiwt924wxgqscx6r8rk` (`user_id`),
  CONSTRAINT `FKtfcyk7kiwt924wxgqscx6r8rk` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `store_proposal`
--

LOCK TABLES `store_proposal` WRITE;
/*!40000 ALTER TABLE `store_proposal` DISABLE KEYS */;
INSERT INTO `store_proposal` VALUES (8,'201-82-04407','2025-06-04 18:22:05.362356','산불피해지역에 기부하셨어요','VOTING',NULL,'상록원',1,'0','0','0'),(9,'202-50-60201','2025-06-04 21:55:20.943194','홍수피해지역에 기부하셨어요','VOTING',NULL,'붓골집',1,NULL,NULL,NULL);
/*!40000 ALTER TABLE `store_proposal` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `users` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `created_at` datetime(6) DEFAULT NULL,
  `is_admin` bit(1) NOT NULL,
  `nickname` varchar(255) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `password` varchar(255) COLLATE utf8mb4_general_ci NOT NULL,
  `username` varchar(255) COLLATE utf8mb4_general_ci NOT NULL,
  `character_stage` enum('ADULT','BABY','CHILD') COLLATE utf8mb4_general_ci DEFAULT NULL,
  `donation_points` int NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `UKr43af9ap4edm43mmtq01oddj6` (`username`)
) ENGINE=InnoDB AUTO_INCREMENT=14 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` VALUES (1,'2025-05-23 18:27:34.243036',_binary '\0','spring','$2a$10$20YYlJZgV53.aTLc04pgU.4cXYTz8tfsTDH.CsEG2CO2qz/OwjPkm','testuser','BABY',4880),(7,'2025-05-23 18:30:02.891728',_binary '\0','테스터','$2a$10$Gz2rmk5KszExkpb/a6n63ex1TnvMxe0YC/Mblwi9xaGO.jkXFGfgi','testuser1',NULL,0),(8,'2025-05-23 19:32:07.089277',_binary '\0','sean1','$2a$10$1IXqx3jdpfpayAHZ4fKjueIuKGCpFYfQr.gAbjmZ1jt52AbVQT8OC','linkage1',NULL,0);
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-06-05 22:26:52
